Repository: Chupacabra2023/soundAppFlutter
Catalog: lib/l10n/app_*.arb
Languages: es, sk

source: Settings
es: Configuración
sk: Nastavenia

source: Add Sound
es: Agregar sonido
sk: Pridať zvuk

source: Loop
es: Repetir
sk: Opakovať

source: Playback Speed
es: Velocidad de reproducción
sk: Rýchlosť prehrávania

source: Delete mode
es: Modo de eliminación
sk: Režim mazania

source: Cancel delete mode
es: Cancelar modo de eliminación
sk: Zrušiť režim mazania

source: Search sounds...
es: Buscar sonidos...
sk: Hľadať zvuky...

source: No sound playing
es: No hay sonido reproduciéndose
sk: Žiadny zvuk sa neprehráva

# nowPlaying
source: Now playing: {title}
es: Reproduciendo: {title}
sk: Práve hrá: {title}

source: Filter
es: Filtro

source: Search
es: Buscar
sk: Hľadať

# soundsCount
source: {count} sounds
es: {count} sonidos
sk: {count} zvukov

source: No sounds found
es: No se encontraron sonidos
sk: Nenašli sa žiadne zvuky

# tryChangingSearch
source: Try changing your search or category
es: Intenta cambiar tu búsqueda o categoría
sk: Skúste zmeniť vyhľadávanie alebo kategóriu

# restoringSound
source: Restoring sounds...
es: Restaurando sonidos...
sk: Obnovujem zvuky...

# pleaseWait
source: Please wait a moment
es: Por favor espera un momento
sk: Prosím počkajte chvíľu

source: Reset Sounds
es: Restablecer sonidos
sk: Resetovať zvuky

# resetSoundsDescription
source: This will delete all current sounds and reload the original sounds with their categories.
es: Esto eliminará todos los sonidos actuales y recargará los sonidos originales con sus categorías.
sk: Toto vymaže všetky aktuálne zvuky a obnoví pôvodné zvuky s ich kategóriami.

# resetToDefault
source: Reset to default sounds
es: Restablecer a sonidos predeterminados
sk: Resetovať na predvolené zvuky

# resetConfirmTitle
source: Reset sounds
es: Restablecer sonidos
sk: Resetovať zvuky

# resetConfirmMessage
source: This will delete all current sounds and reload the original sounds with their categories. Do you want to continue?
es: Esto eliminará todos los sonidos actuales y recargará los sonidos originales con sus categorías. ¿Deseas continuar?
sk: Toto vymaže všetky aktuálne zvuky a obnoví pôvodné zvuky s ich kategóriami. Chcete pokračovať?

source: Cancel
es: Cancelar
sk: Zrušiť

source: Reset
es: Restablecer
sk: Resetovať

source: Manage Categories
es: Gestionar categorías
sk: Spravovať kategórie

# manageCategoriesDescription
source: Delete categories that you no longer need. All sounds with this category will lose it.
es: Elimina las categorías que ya no necesites. Todos los sonidos con esta categoría la perderán.
sk: Vymažte kategórie, ktoré už nepotrebujete. Všetky zvuky s touto kategóriou ju stratia.

source: Delete category
es: Eliminar categoría
sk: Vymazať kategóriu

# deleteCategoryConfirm
source: Are you sure you want to delete "{category}"? All sounds with this category will lose it.
es: ¿Estás seguro de que deseas eliminar "{category}"? Todos los sonidos con esta categoría la perderán.
sk: Naozaj chcete vymazať "{category}"? Všetky zvuky s touto kategóriou ju stratia.

source: Delete
es: Eliminar
sk: Vymazať

# noCustomCategories
source: No custom categories yet
es: Aún no hay categorías personalizadas
sk: Zatiaľ žiadne vlastné kategórie

source: Language
es: Idioma
sk: Jazyk

# selectLanguage
source: Select your preferred language
es: Selecciona tu idioma preferido
sk: Vyberte si preferovaný jazyk

source: Shuffle Play
es: Reproducción aleatoria
sk: Náhodné prehrávanie

# shufflePlayDescription
source: Play random sounds continuously
es: Reproducir sonidos aleatorios continuamente
sk: Prehrávať náhodné zvuky nepretržite

source: everything
es: todo
sk: všetko

source: favorite
es: favorito
sk: obľúbené
